#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
digitalocean_droplet.server: Refreshing state... [id=248917184]
digitalocean_floating_ip_assignment.app-dreiseenstafette-ch-assignment: Refreshing state... [id=248917184-67.207.79.200-20210603221420662300000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.server must be replaced
-/+ resource "digitalocean_droplet" "server" {
      ~ created_at           = "2021-06-03T22:12:52Z" -> (known after apply)
      ~ disk                 = 25 -> (known after apply)
      ~ id                   = "248917184" -> (known after apply)
      ~ image                = "85289905" -> "85463125" # forces replacement
      ~ ipv4_address         = "104.248.20.191" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 1024 -> (known after apply)
        name                 = "server"
      ~ price_hourly         = 0.00744 -> (known after apply)
      ~ price_monthly        = 5 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ size                 = "s-1vcpu-1gb" -> "s-1vcpu-2gb"
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:248917184" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "dfb3c56d-37ac-400e-951e-e02620f5feae" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # digitalocean_firewall.firewall will be created
  + resource "digitalocean_firewall" "firewall" {
      + created_at      = (known after apply)
      + droplet_ids     = (known after apply)
      + id              = (known after apply)
      + name            = "default-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "80"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
    }

  # digitalocean_floating_ip_assignment.app-dreiseenstafette-ch-assignment must be replaced
-/+ resource "digitalocean_floating_ip_assignment" "app-dreiseenstafette-ch-assignment" {
      ~ droplet_id = 248917184 -> (known after apply) # forces replacement
      ~ id         = "248917184-67.207.79.200-20210603221420662300000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @joergmis, Action: `pull_request`*